In [3]:
import numpy as np
import pandas as pd

In [4]:
data_list = [
    ['John', 23, 'NYC', 90000],
    ['Andre', 45, 'LA', 80000],
    ['Shaw', 43, 'PAris', 70000]
]
df = pd.DataFrame(data_list)
col_name = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=col_name)
df2

    Name  Age   City  Salary
0   John   23    NYC   90000
1  Andre   45     LA   80000
2   Shaw   43  PAris   70000

In [7]:
# df2.drop(0, axis=0)
df2.drop(["Age", "City"], axis=1)

    Name  Salary
0   John   90000
1  Andre   80000
2   Shaw   70000